package bwie.recyclerview_refresh_loadmore.bean;

import java.util.List;

/**
 * Created by zjj on 2016/11/22.
 */
public class Joke {
    /**
     * error_code : 0
     * reason : Success
     * result : {"data":[{"content":" 由于脚大，总是买不到合适的高跟鞋。昨天在朋友圈发了一条:哪位知道有卖大码高跟鞋的商场，告知必有重谢。一个二货回:你这难度堪比重金求子啊！顿时石化，这样的损友追到天涯海角都想敲碎他的三叉神经！ ","hashId":"8f5910cd98c4a255f5c1e16efb510d2f","unixtime":1479740630,"updatetime":"2016-11-21 23:03:50"},{"content":" 感冒了，非常难受.一个孩子羞怯地走进办公室:老师，感冒好点没有？是不是很不舒服？我心里顿时暖暖的:这孩子真懂事，还知道关心人。真贴心！她露出了迷之微笑:你身体不舒服就不要检查作业了吧！我没带，嘿嘿！好吧，套路，全是套路！ ","hashId":"de195f55ca9e0329e81bc1303d40bbbb","unixtime":1479740630,"updatetime":"2016-11-21 23:03:50"},{"content":" 今天去相亲，回到家已经泣不成声。妈妈关切问道:咋啦？相个亲怎么委屈了？我抽泣着:男生嫌我平凡没特色！老妈火冒三丈冲进厨房抄起锅铲:呦，这小兔崽子，竟然敢这么说我闺女。看我不收拾他！我闺女腿粗得跟电线杆子似的还不特别？好想找多特别的？我已经收拾好行李准备离家出走了\u2026\u2026 ","hashId":"7c998dc709e7385f40438727f65ebf0d","unixtime":1479740630,"updatetime":"2016-11-21 23:03:50"},{"content":" 今天又去对面的面馆吃牛肉面，面一上桌我就火大了:老板，为什么今天只有三片牛肉？之前都是四片的！退钱！屌丝吃牛肉面也是需要尊严的，姐就是这么有原则！ ","hashId":"c8799e70d6731d755d296f5e8c839203","unixtime":1479738230,"updatetime":"2016-11-21 22:23:50"},{"content":"今天在公交车上看到一妹子，特别漂亮，情不自禁的摸了摸，于是妹子柔柔的对我说，你知道水浒传第七章，第6节嘛？尴尬，只好窃窃的收回了手！","hashId":"ed2861a66936a82b4df817074bd3e423","unixtime":1479699830,"updatetime":"2016-11-21 11:43:50"},{"content":"历史课上老师问：\u201c古时候太监为什么做不了大官！\u201d同学们都很迷茫，这是角落悠悠传来一句话：\u201c没有升职器！\u201d         瞬间教室沸腾了！","hashId":"a0e9daf9a0df38b1451fa9c75caf2def","unixtime":1479699830,"updatetime":"2016-11-21 11:43:50"},{"content":"曾经动过杀人的念头，但是我忍住了，十个月后估计是被他发现了，严重的报复我，我都快崩溃了，一时心软的后果呀！儿子呀！儿子！妈妈真的要困死了，就让妈妈睡个好觉吧\u2026\u2026","hashId":"f8d6bd8412acede5e87ec2500458a10a","unixtime":1479699830,"updatetime":"2016-11-21 11:43:50"},{"content":"叫你偷看本主公洗澡，叫你偷看本主公洗澡，叫你偷看本主公洗澡。。。备注：张飞偷看刘备洗澡，罚扫厕所一个月。凡是把主公看成公主的，必须点个赞。","hashId":"4e2ee673adef8476e2f26104a3f69722","unixtime":1479697430,"updatetime":"2016-11-21 11:03:50"},{"content":"话说唐僧师徒四人来到火焰山，八戒说：\u201c这么热都快成烤猪了\u201d这时候听到轰隆一声巨响！唐僧吓得从马上摔了下来，沙僧赶快去扶着师傅，唐僧说：\u201c悟空，看看什么情况\u201d八戒大喊：\u201c猴哥，猴哥，你妈炸了~\u201d","hashId":"fd0f8e406ee35a2c018c645f6ed7555c","unixtime":1479697430,"updatetime":"2016-11-21 11:03:50"},{"content":"秀才进庙避雨。见一女子在神像下小解,性起将其强暴。女大怒,告上县衙,哭诉:\u201c大雨倾盆,书生进门,掀我罗裙。打我一针。不痛不爽,害我一生\u201d秀才辩称:\u201c大雨如瓢,书生进庙,见一女子,对神撒尿,将其堵上,反被诬告。\u201d县官喝斥:\u201c一个青春,一个年少,鱼水之欢,各有需要,相互满足,有何可告。\u201d女大叫:\u201c怨啊!我还想要,他已拔掉,无情无义,太不人道\u201d秀才吼道:\u201c冤啊,成心堵尿,突闻雷叫,不敢久留,这才拔掉。\u201d县官一拍惊木堂:\u201c本官判决,原告想要,被告拔掉,发回破庙,重演堵尿,退堂。","hashId":"863f49b36da39e0dfe6b5ccce0c44587","unixtime":1479697430,"updatetime":"2016-11-21 11:03:50"}]}
     */

    public int error_code;
    public String reason;
    public ResultBean result;



    public static class ResultBean {
        /**
         * content :  由于脚大，总是买不到合适的高跟鞋。昨天在朋友圈发了一条:哪位知道有卖大码高跟鞋的商场，告知必有重谢。一个二货回:你这难度堪比重金求子啊！顿时石化，这样的损友追到天涯海角都想敲碎他的三叉神经！ 
         * hashId : 8f5910cd98c4a255f5c1e16efb510d2f
         * unixtime : 1479740630
         * updatetime : 2016-11-21 23:03:50
         */

        public List<DataBean> data;
        public static class DataBean {
            public String content;
            public String hashId;
            public int unixtime;
            public String updatetime;
        }
    }
}
